/**/
"Cancel" = "إلغاء الأمر";
/**/
"Delete" = "حذف";
/**/
"Open" = "فتح";
/**/
"Edit" = "تحرير";
/**/
"Yes" = "نعم";
/**/
"Finish" = "إنهاء";
/**/
"Done" = "تم";
/**/
"Save" = "حفظ";
/**/
"Undo" = "تراجع";
/**/
"Redo" = "إعادة";
/**/
"OK" = "موافق";
/**/
"Yes Delete" = "نعم الحذف";


/*Geometry Edit Action Name*/
"Apply Geometry" = "تطبيق الشكل الهندسي";
/*Geometry Edit Action Name*/
"Clear Geometry" = "مسح الشكل الهندسي";
/*Geometry Edit Action Name*/
"Delete Vertex" = "حذف النقطة القممية";
/*Geometry Edit Action Name*/
"Insert Part" = "إدراج جزء";
/*Geometry Edit Action Name*/
"Insert Vertex" = "إدارج نقطة قممية";
/*Geometry Edit Action Name*/
"Move Vertex" = "تحريك النقطة القممية";
/*Geometry Edit Action Name*/
"Remove Part" = "إزالة جزء";

/*Collecting attachments*/
"Add" = "إضافة";
/*Collecting attachments*/
"Take Photo or Video" = "التقاط صورة أو فيديو";
/*Collecting attachments*/
"Choose From Library" = "اختيار من المكتبة";
/*Collecting attachments*/
"Photo" = "صورة";
/*Collecting attachments*/
"Video" = "فيديو";
/*Collecting attachments*/
"Save To Photo Library" = "حفظ في مكتبة الصور";
/*Collecting attachments*/
"Download" = "تحميل";

/*Date attribute*/
"Today" = "اليوم";

/**/
"Attachments" = "المرفقات";
"Attributes" = "السمات";

/**/
"Open in Safari" = "فتح في Safari";

/* Please enter a numeric value between 0 and 5.*/
"Enter a number between %i and %i." = "أدخل رقمًا بين %i و %i.";

/* Please enter a numeric value between 0.5 and 5.0.*/
"Enter a number between %@ and %@." = "أدخل رقم بين %@ و %@.";

/* string length error, when user enters too many characters in string attribute editor:
  Too many characters.  Current: 512.  Allowed: 256 */
"Too many characters (%@)" = "عدد الحروف كبير جدًا (%@)";

/* When a number is entered outside the range */
"Number is outside the acceptable range." = "الرقم يقع خارج النطاق المقبول.";

/* BLOB, RASTER, etc */
"Field type not supported" = "نوع الحقل غير مدعوم.";

/**/
"%d of %d" = "%d من %d";

/**/
"Changing Feature Type" = "يتم الآن تغيير نوع الميزة";
"You are changing the feature type, which may potentially overwrite some field values. Are you sure you want to do this?" =  "أنت تقوم الآن بتغيير نوع الميزة، والتي من المحتمل أن تؤدي للكتابة فوق قيم الحقل. هل ترغب بالفعل في القيام بذلك؟";

/**/
"Deleting Feature" = "حذف المعالم";
"Are you sure you want to delete this feature?" = "هل أنت متأكد من رغبتك في حذف هذا المعلم؟";

/**/
"Data for pie chart is invalid" = "بيانات المخطط الدائري غير صحيحة";
"No data to create a pie chart" = "لا توجد بيانات لإنشاء مخطط دائري";
"No image to display" = "لا يوجد صور للعرض";

/**/
"Created by %@ seconds ago" = "تم الإنشاء بواسطة %@ منذ ثوان";

/**/
"Created by %@ a minute ago" = "تم الإنشاء بواسطة %@ منذ دقيقة";

/**/
"Edited by %@ seconds ago" = "تم التحرير بواسطة %@ منذ ثوان";

/**/
"Edited by %@ a minute ago" = "تم التحرير بواسطة %@ منذ دقيقة";

/**/
"Created seconds ago" = "تم الإنشاء منذ ثوانٍ";

/**/
"Created a minute ago" = "تم الإنشاء منذ دقيقة";

/**/
"Edited seconds ago" = "تم التحرير منذ ثوانٍ";

/**/
"Edited a minute ago" = "تم التحرير منذ دقيقة";

/**/
"Created by %@ %d minutes ago" = "تم الإنشاء بواسطة %@ منذ %d دقيقة (دقائق)";

/**/
"Created by %@ an hour ago" = "تم الإنشاء بواسطة %@ منذ ساعة";

/**/
"Created by %@ %d hours ago" = "تم الإنشاء بواسطة %@ منذ %d ساعة (ساعات)";

/*"Created by %@ on ${weekDay} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - day" = "تم الإنشاء بواسطة %@ يوم %@ في %@";

/*"Created by %@ on ${formattedDate} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - full" = "تم الإنشاء بواسطة %@ يوم %@ في %@";

/**/
"Edited by %@ %d minutes ago" = "تم التحرير بواسطة %@ منذ %d دقيقة (دقائق)";

/**/
"Edited by %@ an hour ago" = "تم التحرير بواسطة %@ منذ دقيقة";

/**/
"Edited by %@ %d hours ago" = "تم التحرير بواسطة %@ منذ %d ساعة (ساعات)";

/**/
"Edited by %@ on %@ at %@ - day" = "تم التحرير بواسطة %@ يوم %@ في %@";

/**/
"Edited by %@ on %@ at %@ - full" = "تم التحرير بواسطة %@ يوم %@ في %@";

/**/
"Created by %@" = "تم الإنشاء بواسطة %@";

/**/
"Edited by %@" = "تم التحرير بواسطة %@";

/**/
"Created %d minutes ago" = "تم الإنشاء منذ %d دقيقة (دقائق)";

/**/
"Created an hour ago" = "تم الإنشاء منذ ساعة";

/**/
"Created %d hours ago" = "تم الإنشاء منذ %d ساعة (ساعات)";

/*"Created on ${weekDay} at ${formattedTime}"*/
"Created on %@ at %@ - day" = "تم الإنشاء يوم %@ في %@";

/*"Created on ${formattedDate} at ${formattedTime}"*/
"Created on %@ at %@ - full" = "تم الإنشاء يوم %@ في %@";

/**/
"Edited %d minutes ago" = "تم التحرير منذ %d دقيقة (دقائق)";

/**/
"Edited an hour ago" = "تم التحرير منذ ساعة";

/**/
"Edited %d hours ago" = "تم التحرير منذ %d ساعة (ساعات)";

/*"Edited on ${weekDay} at ${formattedTime}"*/
"Edited on %@ at %@ - day" = "تم التحرير يوم %@ في %@";

/*"Edited on ${formattedDate} at ${formattedTime}"*/
"Edited on %@ at %@ - full" = "تم التحرير يوم %@ في %@";

/* Used to denote a required field */
"Required" = "مطلوب";

/* Used for naming layers with no names */
"Layer %d" = "الطبقة %d";

/* Geocoding: returned when locator cannot find address for given location */
"Cannot find address for location" = "يتعذر العثور على عنوان الموقع";

/* Geocoding: returned when locator cannot find location for given address */
"Cannot find location for address" = "يتعذر العثور على موقع العنوان";

/* Geocoding: core: used when address cannot be read */
"Cannot read address" = "يتعذر قراءة العنوان";

/* Geocoding: core: used when one of the locator files cannot be found */
"File not found" = "لم يتم العثور على الملف";

/* Geocoding: core: returned when locator cannot be loaded */
"Cannot load locator" = "يتعذر تحميل محدد المواقع";

/* Geocoding: core: returned when some internal engine error occurs */
"Locator internal error" = "خطأ داخلي في محدد المواقع";

/* Geocoding: core: used when client tried to geocode intersections while locator does not support it */
"Intersections geocoding is not supported by locator" = "لم يتم دعم التكويد الجغرافي للتقاطعات بواسطة محدد المواقع";

/* Geocoding: core: returned when some locator property is not valid */
"Invalid locator properties" = "خصائص محدد المواقع غير صحيحة";

/* Geocoding: core: used when client did not set required field for address geocoding */
"Required field is missing" = "الحقل المطلوب مفقود";

/* Geocoding: core: used when operation is performed over uninitialized locator */
"Locator is not initialized" = "لم يتم تهيئة محدد المواقع";

/* Geocoding: core: returned when locator format is not supported */
"Unsupported locator format" = "تنسيق محدد المواقع غير مدعوم";

/* Geocoding: core: returned when geocoding engine cannot make projection transformation */
"Unsupported projection transformation" = "تحويل الإسقاط غير مدعوم";

/* Geocoding: core: used when given spatial reference is not supported */
"Unsupported spatial reference" = "الإسناد المكاني غير مدعوم";

/*Geocoding: core: used when locator being used does not support reverse geocoding */
"Reverse geocoding not supported with this locator." = "التكويد الجغرافي غير مدعوم مع محدد المواقع هذا.";

/* Network analyst errors */
"Cannot open network." = "يتعذر فتح الشبكة.";
"Cannot retrieve route task parameters." = "يتعذر استرداد معلمات مهمة التوجيه.";
"Insufficient number of stops." = "عدد غير كاف من علامات التوقف.";
"Stop (%@) was not located." = "لم يتم تحديد موضع علامة التوقف (%@)";
"Stop (%@) is located on a non traversable element." = "يتم تحديد موضع علامة التوقف (%@) على العنصر الغير ممكن اجتيازه.";
"Stop (%@) is located on a soft restricted element." = "يتم تحديد موضع علامة التوقف  (%@) على العنصر المقيد المرن.";
"Point barrer (%@) was not located." = "تم تحديد موضع حاجز النقطة (%@).";
"Point barrier (%@) has invalid added cost attribute name." = "حاجز النقطة (%@) لديه اسم غير صحيح لبيانات التكلفة الجدولية المضاف.";
"Line barrier (%@) has invalid scaled cost attribute name." = "حاجز الخط (%@) لديه اسم غير صحيح لبيانات التكلفة الجدولية محددة الحجم.";
"Line barrier (%@) does not cover any network elements." = "لا يشمل حاجز الخط (%@) أي عناصر من عناصر الشبكة.";
"Polygon barrier (%@) has invalid scaled cost attribute name." = "حاجز المضلع (%@)لديه اسم غير صحيح لبيانات التكلفة الجدولية محددة الحجم.";
"Polygon barrier (%@) does not cover any network elements." = "لا يشمل حاجز المضلع (%@) أي عناصر من عناصر الشبكة.";
"'%@' is an invalid impedance attribute." = "'%@' هو بيانات جدولية معاوقة غير صحيحة.";
"'%@' restriction attribute is invalid." = "بيانات القيد الجدولية '%@' غير صحيحة.";
"'%@' accumulate attribute is invalid." = "بيانات التجميع '%@' الجدولية غير صحيحة.";
"'%@' is an invalid directions time attribute." = "'%@' هي بيانات جدولية غير صحيحة لوقت الاتجاهات.";
"Directions distance attribute is invalid." = "بيانات مسافة الاتجاهات الجدولية غير صحيحة.";
"Invalid attribute parameter attribute name (%@)." = "اسم سمة معلمة البيانات الجدولية غير الصحيحة (%@).";
"Invalid attribute parameter parameter name (%@)." = "اسم معلمة معلمة البيانات الجدولية غير الصحيحة (%@).";
"Invalid value type for attribute (%1$@) parameter (%2$@)." = "نوع القيمة غير الصحيحة لمعلمة (%1$@) البيانات الجدولية (%2$@).";
"Invalid restriction usage value for attribute (%1$@) parameter (%2$@)." = "قيمة استخدام القيد الغير صحيح لمعلمة (%1$@) البيانات الجدولية (%2$@).";
"Neutral restriction usage value for attribute (%1$@) parameter (%2$@)." = "قيم استخدام القيد المحايد لمعلمة (%1$@) البيانات الجدولية (%2$@).";
"Soft restricted element (%@) was traversed." = "تم انتقال عنصر القيد المرن (%@).";
"The network does not have a hierarchy attribute for performing hierarchical route planning." = "لا تحتوي الشبكة على بيانات جدولية هيكلية لإجراء عملية التخطيط للتوجيه الهيكلي.";
"No path can be found between a given pair of stops (%@)." = "يمكن العثور على المسار بين زوج علامات التوقف المقدمة (%@).";
"The input spatial reference is undefined." = "الإسناد المكاني للمدخلات غير محدد.";
"The output spatial reference is undefined." = "الإسناد المكاني للمخرجات غير محدد.";
"The directions style is invalid." = "نم الاتجاهات غير صحيح.";
"The directions language is invalid." = "لغة الاتجاهات غير صحيحة.";
"Directions time and distance attributes do not match." = "وقت الاتجاهات والبيانات الجدولية للمسافة غير مطابقة.";
"The directions road class attribute is invalid." = "بيانات تصنيف طرق الاتجاهات غير صحيح.";
"Unknown condition." = "الحالة غير معروفة.";
"Invalid route task parameters." = "معلمات مهمة التوجيه غير الصحيحة.";
"Route task's solution cannot be found." = "يتعذر العثور على حل مهمة التوجيه.";
"Route task was cancelled." = "تم إلغاء مهمة التوجيه.";
"Route task internal error." = "خطأ داخلي في مهمة التوجيه.";
"Route name property is not supported for local route task." = "لا يتم دعم خاصية اسم التوجيه لمهمة التوجيه المحلية.";
"Local route task parameters should be retrieved from route task." = "ينبغي استرداد معلمات مهمة التوجيه المحلية من مهمة التوجيه.";
"Cannot retrieve network description." = "يتعذر استرداد وصف الشبكة.";
"Only one length attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "يمكن تحديد البيانات الجدولية لطول واحد فقط لـ impedanceAttributeName و accumulateAttributeNames.";
"Only one time attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "يمكن تحديد البيانات الجدولية مرة واحدة فقط لـ impedanceAttributeName و accumulateAttributeNames.";
"Service not supported." = "الخدمة غير مدعومة.";
"Specified start time occurs before January 1, 1970." = "زمن التشغيل المحدد يحدث قبل 1 يناير 1970.";
"Stop (%@) has a start time that occurs before January 1, 1970." = "علامة التوقف (%@) لها زمن تشغيل يحدث قبل 1 يناير 1970.";
"Stop (%@) has a local time window that starts before January 1, 1970." = "علامة التوقف (%@) لها نافذة زمنية محلية تبدأ قبل 1 يناير 1970.";
"Stop (%@) has a UTC time window that starts before January 1, 1970." = "علامة التوقف (%@) لها نافذة زمنية UTC تبدأ قبل 1 يناير 1970.";
"Stop (%@) has a time window end that occurs before its time window start." = "علامة التوقف (%@) لها نافذة زمنية تحدث قبل بدء تشغيل النافذة الزمنية.";

/* Unit Abbreviated strings */
"cm" = "سم";
"dd" = "dd";
"dm" = "ديسيمتر";
"ft" = "قدم";
"in" = "بوصة";
"km" = "كيلومتر";
"m" = "متر";
"mi" = "ميل";
"mm" = "ملم";
"nm" = "ميل بحري";
"pt" = "pt";
"Unknown" = "غير معروف";
"yd" = "yd";

/* Unit Display Strings */
"Centimeters" = "سنتميترات";
"Decimal Degrees" = "الدرجات العشرية";
"Decimeters" = "ديسيميتر";
"Feet" = "قدم";
"Inches" = "بوصة";
"Kilometers" = "كيلومترات";
"Meters" = "أمتار";
"Miles" = "أميال";
"Millimeters" = "ميلليميتر";
"Nautical Miles" = "الأميال البحرية";
"Points" = "نقاط";
"Yards" = "ياردات";

/* Area Units Abbreviated Strings */
"sq. in" = "sq. in";
"sq. ft" = "قدم مربع";
"sq. yd" = "يارد مربعة";
"ac" = "ac";
"sq. mi" = "ميل مربع";
"sq. mm" = "ملليمتر مربع";
"sq. cm" = "سنتيمتر مربع";
"sq. dm" = "ديسيمتر مربع";
"sq. m" = "متر مربع";
"ares" = "آر";
"ha" = "هكتار";
"sq. km" = "كيلومتر مربع";

/* Area Units Display Strings */
"Square Inches" = "بوصات مربعة";
"Square Feet" = "قدم مربع";
"Square Yards" = "ياردات مربعة";
"Acres" = "فدان";
"Square Miles" = "ميل مربع";
"Square Millimeters" = "ميلليمترات مربعة";
"Square Centimeters" = "سنتيمترات مربعة";
"Square Decimeters" = "ديسيمترات مربعة";
"Square Meters" = "أمتار مربعة";
"Ares" = "آر";
"Hectares" = "هكتار";
"Square Kilometers" = "كيلومترات مربعة";

/* Errors */
"Error" = "خطأ";
"Class not @protocol AGSJSONSerializable compliant" = "التصنيف غير متوافق مع @protocol AGSJSONSerializable";
"Authorization required" = "يلزم التخويل";
"Token is invalid or has expired" = "الرمز المميز غير صحيح أو انتهت صلاحيته";
"Unknown error occurred" = "حدث خطأ غير معروف";
"Empty username/password" = "اسم مستخدم/كلمة مرور فارغ";
"Token URL is nil. You must set a valid token URL on the credential." = "عنوان URL للرقم المميز هو لا شيء";
"Unknown authentication error" = "خطأ مصادقة غير معروف";
"Error extracting identity" = "خطأ أثناء استخراج الهوية";
"Error adding identity to the keychain" = "خطأ في إضافة الهوية إلى السلسلة الرئيسية";
"Invalid Credentials" = "اعتمادات غير صحيحة";
"Bad URL." = "عنوان URL غير صحيح";
"The feature layer does not expose an object-id field." = "طبقة المعالم لا تكشف حقل مُعرف الكائن.";
"Both geodatabase and syncParams are required for this method." = "تتطلب هذه الطريقة وجود قاعدة بيانات جغرافية وsyncParams.";
"Uploading deltas is not supported with this replica." = "تحميل الدلتا غير مدعوم في هذه النسخة المماثلة.";
"Error creating delta geodatabase" = "خطأ في إنشاء قاعدة البيانات الجغرافية دلتا";
"Unable to create result image layer" = "يتعذر إنشاء طبقة الصورة الناتجة";
"Cache at path '%@' not found." = "لم يتم العثور على التخزين المؤقت في مسار '%@'.";
"To add an item, you must be logged in to the portal." = "لإضافة عنصر، يتعين عليك تسجيل الدخول إلى البوابة الإلكترونية.";
"To add an item, you must specify a value in the AGSPortalItemContentParameters." = "لإضافة عنصر، يتعين عليك تحديد قيمة في AGSPortalItemContentParameters.";
"The portal failed to add the item." = "فشل البوابة الإلكترونية في إضافة العنصر.";
"To delete an item, you must be logged in to the portal." = "لحذف عنصر ما، يتعين عليك تسجيل الدخول إلى البوابة الإلكترونية.";
"The portal failed to delete the item." = "فشل البوابة الإلكترونية في حذف العنصر.";
"To update an item, an itemId and logged in user are required." = "لتحديث عنصر، يلزم وجود مُعرف العنصر وتسجيل دخول المستخدم.";
"The item failed to update." = "فشل العنصر في التحديث.";
"The item failed to update JSON." = "فشل العنصر في تحديث JSON.";
"You must be logged in to a portal to add a comment." = "يتعين عليك تسجيل الدخول إلى البوابة الإلكترونية لإضافة تعليق.";
"The comment failed to be added." = "فشل إضافة التعليق";
"You must be logged in to a portal to fetch the current user's rating." = "يتعين عليك تسجيل الدخول إلى البوابة الإلكترونية لإحضار تصنيف مستخدم حالي.";
"You must be logged in to a portal to add a rating." = "يتعين عليك تسجيل الدخول إلى البوابة الإلكترونية لإضافة تصنيف.";
"The rating failed to be added." = "فشل إضافة التصنيف.";
"To share an item, you must be logged in to the portal." = "لمشاركة عنصر، يتعين عليك تسجيل الدخول إلى البوابة الإلكترونية.";
"To unshare an item, you must be logged in to the portal and specify groups with which to unshare the item." = "لإلغاء مشاركة عنصر ما،  يتعين عليك تسجيل الدخول إلى البوابة الإلكترونية وتحديد المجموعات المراد إلغاء مشاركة العنصر معها.";
"Bad Request" = "طلب غير صحيح";
"Credential Required" = "يلزم AGSCredential";
"Job not created" = "لم يتم إنشاء الوظيفة";
"Service did not return a valid URL" = "لم تقم الخدمة بإرجاع عنوان URL صحيح";
"Service did not return a file" = "لم تقم الخدمة بإرجاع أي ملف";
"Service did not return a size" = "لم تقم الخدمة بإرجاع أي حجم";
"Job failed" = "فشلت الوظيفة";
"Job timed out" = "تم انقضاء مهلة الوظيفة";
"Job was cancelled" = "تم إلغاء الوظيفة";
"Job was deleted" = "تم حذف الوظيفة";
"Feature with objectId: %d not found" = "يتعذر إيجاد المعالم ذات مُعرف الكائن: %d";
"No object-id values specified for feature table query." = "لا يوجد قيم لمعرف الكائن خاصة بالاستعلام عن جدول المعلم.";

/* OAuth */
"The specified clientID is invalid" = "clientID المحدد غير صحيح";

/* Sync */
"Upload is not supported with this service." = "التنزيل غير مدعوم باستخدام هذه الخدمة.";
"In order to call sync, a sync direction other than AGSGDBSyncDirectionNone must be specified." = "لاستدعاء التزامن، يتعين تحديد اتجاه التزامن خلاف AGSGDBSyncDirectionNone.";